// bindgen halflife/pm_shared/pm_defs.h --allowlist-type "playermove_s" --
// --target=i686-unknown-linux-gnu -Ihalflife/{public,common,engine} -include mathlib.h -include
// const.h
// Keep everything before the generated part
// Then change playermove_s.flags member to use [`edict::Flags`] type
// Then change playermove_s.PlayerTrace argument `traceFlags` to use [`TraceFlags`] type
// Then change playermove_s.PlayerTrace argument `start` and `end` to `*const ...` from `*mut ...`

// For some reasons, this `playermove_s` also generates physent, pmplane, pmtrace, and usercmd.

#![allow(unused, nonstandard_style, deref_nullptr)]

use std::mem::{align_of, size_of};
use std::os::raw::*;
use std::ptr::null;

use bitflags::bitflags;

use crate::ffi::edict;

bitflags! {
    #[derive(Debug, Clone, Copy, PartialEq, Eq)]
    #[repr(C)]
    pub struct TraceFlags: c_int {
        const PM_NORMAL = 0;
        const PM_STUDIO_IGNORE = 1;
        const PM_STUDIO_BOX = 1 << 1;
        const PM_GLASS_IGNORE = 1 << 2;
        const PM_WORLD_ONLY = 1 << 3;
    }
}

pub const PM_TRACELINE_PHYSENTONLY: TraceLineFlag = 0;
pub const PM_TRACELINE_ANYVISIBLE: TraceLineFlag = 1;
pub type TraceLineFlag = c_int;

/* automatically generated by rust-bindgen 0.71.1 */

#[doc = "\tCopyright (c) 1996-2002, Valve LLC. All rights reserved.\n\n\tThis product contains software technology licensed from Id\n\tSoftware, Inc. (\"Id Technology\").  Id Technology (c) 1996 Id Software, Inc.\n\tAll Rights Reserved.\n\n   Use, distribution, and modification of this source code and/or resulting\n   object code is restricted to non-commercial enhancements to products from\n   Valve LLC.  All other use, distribution, or modification is prohibited\n   without written permission from Valve LLC."]
pub type vec_t = f32;
pub type vec3_t = [vec_t; 3usize];
pub type byte = ::std::os::raw::c_uchar;
pub const qboolean_false_: qboolean = 0;
pub const qboolean_true_: qboolean = 1;
pub type qboolean = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct edict_s {
    _unused: [u8; 0],
}
pub type edict_t = edict_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct plane_t {
    pub normal: vec3_t,
    pub dist: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of plane_t"][::std::mem::size_of::<plane_t>() - 16usize];
    ["Alignment of plane_t"][::std::mem::align_of::<plane_t>() - 4usize];
    ["Offset of field: plane_t::normal"][::std::mem::offset_of!(plane_t, normal) - 0usize];
    ["Offset of field: plane_t::dist"][::std::mem::offset_of!(plane_t, dist) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct trace_t {
    pub allsolid: qboolean,
    pub startsolid: qboolean,
    pub inopen: qboolean,
    pub inwater: qboolean,
    pub fraction: f32,
    pub endpos: vec3_t,
    pub plane: plane_t,
    pub ent: *mut edict_t,
    pub hitgroup: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of trace_t"][::std::mem::size_of::<trace_t>() - 56usize];
    ["Alignment of trace_t"][::std::mem::align_of::<trace_t>() - 4usize];
    ["Offset of field: trace_t::allsolid"][::std::mem::offset_of!(trace_t, allsolid) - 0usize];
    ["Offset of field: trace_t::startsolid"][::std::mem::offset_of!(trace_t, startsolid) - 4usize];
    ["Offset of field: trace_t::inopen"][::std::mem::offset_of!(trace_t, inopen) - 8usize];
    ["Offset of field: trace_t::inwater"][::std::mem::offset_of!(trace_t, inwater) - 12usize];
    ["Offset of field: trace_t::fraction"][::std::mem::offset_of!(trace_t, fraction) - 16usize];
    ["Offset of field: trace_t::endpos"][::std::mem::offset_of!(trace_t, endpos) - 20usize];
    ["Offset of field: trace_t::plane"][::std::mem::offset_of!(trace_t, plane) - 32usize];
    ["Offset of field: trace_t::ent"][::std::mem::offset_of!(trace_t, ent) - 48usize];
    ["Offset of field: trace_t::hitgroup"][::std::mem::offset_of!(trace_t, hitgroup) - 52usize];
};
pub type int32 = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pmplane_t {
    pub normal: vec3_t,
    pub dist: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pmplane_t"][::std::mem::size_of::<pmplane_t>() - 16usize];
    ["Alignment of pmplane_t"][::std::mem::align_of::<pmplane_t>() - 4usize];
    ["Offset of field: pmplane_t::normal"][::std::mem::offset_of!(pmplane_t, normal) - 0usize];
    ["Offset of field: pmplane_t::dist"][::std::mem::offset_of!(pmplane_t, dist) - 12usize];
};
pub type pmtrace_t = pmtrace_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pmtrace_s {
    pub allsolid: qboolean,
    pub startsolid: qboolean,
    pub inopen: qboolean,
    pub inwater: qboolean,
    pub fraction: f32,
    pub endpos: vec3_t,
    pub plane: pmplane_t,
    pub ent: ::std::os::raw::c_int,
    pub deltavelocity: vec3_t,
    pub hitgroup: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pmtrace_s"][::std::mem::size_of::<pmtrace_s>() - 68usize];
    ["Alignment of pmtrace_s"][::std::mem::align_of::<pmtrace_s>() - 4usize];
    ["Offset of field: pmtrace_s::allsolid"][::std::mem::offset_of!(pmtrace_s, allsolid) - 0usize];
    ["Offset of field: pmtrace_s::startsolid"]
        [::std::mem::offset_of!(pmtrace_s, startsolid) - 4usize];
    ["Offset of field: pmtrace_s::inopen"][::std::mem::offset_of!(pmtrace_s, inopen) - 8usize];
    ["Offset of field: pmtrace_s::inwater"][::std::mem::offset_of!(pmtrace_s, inwater) - 12usize];
    ["Offset of field: pmtrace_s::fraction"][::std::mem::offset_of!(pmtrace_s, fraction) - 16usize];
    ["Offset of field: pmtrace_s::endpos"][::std::mem::offset_of!(pmtrace_s, endpos) - 20usize];
    ["Offset of field: pmtrace_s::plane"][::std::mem::offset_of!(pmtrace_s, plane) - 32usize];
    ["Offset of field: pmtrace_s::ent"][::std::mem::offset_of!(pmtrace_s, ent) - 48usize];
    ["Offset of field: pmtrace_s::deltavelocity"]
        [::std::mem::offset_of!(pmtrace_s, deltavelocity) - 52usize];
    ["Offset of field: pmtrace_s::hitgroup"][::std::mem::offset_of!(pmtrace_s, hitgroup) - 64usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usercmd_s {
    pub lerp_msec: ::std::os::raw::c_short,
    pub msec: byte,
    pub viewangles: vec3_t,
    pub forwardmove: f32,
    pub sidemove: f32,
    pub upmove: f32,
    pub lightlevel: byte,
    pub buttons: ::std::os::raw::c_ushort,
    pub impulse: byte,
    pub weaponselect: byte,
    pub impact_index: ::std::os::raw::c_int,
    pub impact_position: vec3_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of usercmd_s"][::std::mem::size_of::<usercmd_s>() - 52usize];
    ["Alignment of usercmd_s"][::std::mem::align_of::<usercmd_s>() - 4usize];
    ["Offset of field: usercmd_s::lerp_msec"]
        [::std::mem::offset_of!(usercmd_s, lerp_msec) - 0usize];
    ["Offset of field: usercmd_s::msec"][::std::mem::offset_of!(usercmd_s, msec) - 2usize];
    ["Offset of field: usercmd_s::viewangles"]
        [::std::mem::offset_of!(usercmd_s, viewangles) - 4usize];
    ["Offset of field: usercmd_s::forwardmove"]
        [::std::mem::offset_of!(usercmd_s, forwardmove) - 16usize];
    ["Offset of field: usercmd_s::sidemove"][::std::mem::offset_of!(usercmd_s, sidemove) - 20usize];
    ["Offset of field: usercmd_s::upmove"][::std::mem::offset_of!(usercmd_s, upmove) - 24usize];
    ["Offset of field: usercmd_s::lightlevel"]
        [::std::mem::offset_of!(usercmd_s, lightlevel) - 28usize];
    ["Offset of field: usercmd_s::buttons"][::std::mem::offset_of!(usercmd_s, buttons) - 30usize];
    ["Offset of field: usercmd_s::impulse"][::std::mem::offset_of!(usercmd_s, impulse) - 32usize];
    ["Offset of field: usercmd_s::weaponselect"]
        [::std::mem::offset_of!(usercmd_s, weaponselect) - 33usize];
    ["Offset of field: usercmd_s::impact_index"]
        [::std::mem::offset_of!(usercmd_s, impact_index) - 36usize];
    ["Offset of field: usercmd_s::impact_position"]
        [::std::mem::offset_of!(usercmd_s, impact_position) - 40usize];
};
pub type usercmd_t = usercmd_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct physent_s {
    pub name: [::std::os::raw::c_char; 32usize],
    pub player: ::std::os::raw::c_int,
    pub origin: vec3_t,
    pub model: *mut model_s,
    pub studiomodel: *mut model_s,
    pub mins: vec3_t,
    pub maxs: vec3_t,
    pub info: ::std::os::raw::c_int,
    pub angles: vec3_t,
    pub solid: ::std::os::raw::c_int,
    pub skin: ::std::os::raw::c_int,
    pub rendermode: ::std::os::raw::c_int,
    pub frame: f32,
    pub sequence: ::std::os::raw::c_int,
    pub controller: [byte; 4usize],
    pub blending: [byte; 2usize],
    pub movetype: ::std::os::raw::c_int,
    pub takedamage: ::std::os::raw::c_int,
    pub blooddecal: ::std::os::raw::c_int,
    pub team: ::std::os::raw::c_int,
    pub classnumber: ::std::os::raw::c_int,
    pub iuser1: ::std::os::raw::c_int,
    pub iuser2: ::std::os::raw::c_int,
    pub iuser3: ::std::os::raw::c_int,
    pub iuser4: ::std::os::raw::c_int,
    pub fuser1: f32,
    pub fuser2: f32,
    pub fuser3: f32,
    pub fuser4: f32,
    pub vuser1: vec3_t,
    pub vuser2: vec3_t,
    pub vuser3: vec3_t,
    pub vuser4: vec3_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of physent_s"][::std::mem::size_of::<physent_s>() - 224usize];
    ["Alignment of physent_s"][::std::mem::align_of::<physent_s>() - 4usize];
    ["Offset of field: physent_s::name"][::std::mem::offset_of!(physent_s, name) - 0usize];
    ["Offset of field: physent_s::player"][::std::mem::offset_of!(physent_s, player) - 32usize];
    ["Offset of field: physent_s::origin"][::std::mem::offset_of!(physent_s, origin) - 36usize];
    ["Offset of field: physent_s::model"][::std::mem::offset_of!(physent_s, model) - 48usize];
    ["Offset of field: physent_s::studiomodel"]
        [::std::mem::offset_of!(physent_s, studiomodel) - 52usize];
    ["Offset of field: physent_s::mins"][::std::mem::offset_of!(physent_s, mins) - 56usize];
    ["Offset of field: physent_s::maxs"][::std::mem::offset_of!(physent_s, maxs) - 68usize];
    ["Offset of field: physent_s::info"][::std::mem::offset_of!(physent_s, info) - 80usize];
    ["Offset of field: physent_s::angles"][::std::mem::offset_of!(physent_s, angles) - 84usize];
    ["Offset of field: physent_s::solid"][::std::mem::offset_of!(physent_s, solid) - 96usize];
    ["Offset of field: physent_s::skin"][::std::mem::offset_of!(physent_s, skin) - 100usize];
    ["Offset of field: physent_s::rendermode"]
        [::std::mem::offset_of!(physent_s, rendermode) - 104usize];
    ["Offset of field: physent_s::frame"][::std::mem::offset_of!(physent_s, frame) - 108usize];
    ["Offset of field: physent_s::sequence"]
        [::std::mem::offset_of!(physent_s, sequence) - 112usize];
    ["Offset of field: physent_s::controller"]
        [::std::mem::offset_of!(physent_s, controller) - 116usize];
    ["Offset of field: physent_s::blending"]
        [::std::mem::offset_of!(physent_s, blending) - 120usize];
    ["Offset of field: physent_s::movetype"]
        [::std::mem::offset_of!(physent_s, movetype) - 124usize];
    ["Offset of field: physent_s::takedamage"]
        [::std::mem::offset_of!(physent_s, takedamage) - 128usize];
    ["Offset of field: physent_s::blooddecal"]
        [::std::mem::offset_of!(physent_s, blooddecal) - 132usize];
    ["Offset of field: physent_s::team"][::std::mem::offset_of!(physent_s, team) - 136usize];
    ["Offset of field: physent_s::classnumber"]
        [::std::mem::offset_of!(physent_s, classnumber) - 140usize];
    ["Offset of field: physent_s::iuser1"][::std::mem::offset_of!(physent_s, iuser1) - 144usize];
    ["Offset of field: physent_s::iuser2"][::std::mem::offset_of!(physent_s, iuser2) - 148usize];
    ["Offset of field: physent_s::iuser3"][::std::mem::offset_of!(physent_s, iuser3) - 152usize];
    ["Offset of field: physent_s::iuser4"][::std::mem::offset_of!(physent_s, iuser4) - 156usize];
    ["Offset of field: physent_s::fuser1"][::std::mem::offset_of!(physent_s, fuser1) - 160usize];
    ["Offset of field: physent_s::fuser2"][::std::mem::offset_of!(physent_s, fuser2) - 164usize];
    ["Offset of field: physent_s::fuser3"][::std::mem::offset_of!(physent_s, fuser3) - 168usize];
    ["Offset of field: physent_s::fuser4"][::std::mem::offset_of!(physent_s, fuser4) - 172usize];
    ["Offset of field: physent_s::vuser1"][::std::mem::offset_of!(physent_s, vuser1) - 176usize];
    ["Offset of field: physent_s::vuser2"][::std::mem::offset_of!(physent_s, vuser2) - 188usize];
    ["Offset of field: physent_s::vuser3"][::std::mem::offset_of!(physent_s, vuser3) - 200usize];
    ["Offset of field: physent_s::vuser4"][::std::mem::offset_of!(physent_s, vuser4) - 212usize];
};
pub type physent_t = physent_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct playermove_s {
    pub player_index: ::std::os::raw::c_int,
    pub server: qboolean,
    pub multiplayer: qboolean,
    pub time: f32,
    pub frametime: f32,
    pub forward: vec3_t,
    pub right: vec3_t,
    pub up: vec3_t,
    pub origin: vec3_t,
    pub angles: vec3_t,
    pub oldangles: vec3_t,
    pub velocity: vec3_t,
    pub movedir: vec3_t,
    pub basevelocity: vec3_t,
    pub view_ofs: vec3_t,
    pub flDuckTime: f32,
    pub bInDuck: qboolean,
    pub flTimeStepSound: ::std::os::raw::c_int,
    pub iStepLeft: ::std::os::raw::c_int,
    pub flFallVelocity: f32,
    pub punchangle: vec3_t,
    pub flSwimTime: f32,
    pub flNextPrimaryAttack: f32,
    pub effects: ::std::os::raw::c_int,
    pub flags: edict::Flags,
    pub usehull: ::std::os::raw::c_int,
    pub gravity: f32,
    pub friction: f32,
    pub oldbuttons: ::std::os::raw::c_int,
    pub waterjumptime: f32,
    pub dead: qboolean,
    pub deadflag: ::std::os::raw::c_int,
    pub spectator: ::std::os::raw::c_int,
    pub movetype: ::std::os::raw::c_int,
    pub onground: ::std::os::raw::c_int,
    pub waterlevel: ::std::os::raw::c_int,
    pub watertype: ::std::os::raw::c_int,
    pub oldwaterlevel: ::std::os::raw::c_int,
    pub sztexturename: [::std::os::raw::c_char; 256usize],
    pub chtexturetype: ::std::os::raw::c_char,
    pub maxspeed: f32,
    pub clientmaxspeed: f32,
    pub iuser1: ::std::os::raw::c_int,
    pub iuser2: ::std::os::raw::c_int,
    pub iuser3: ::std::os::raw::c_int,
    pub iuser4: ::std::os::raw::c_int,
    pub fuser1: f32,
    pub fuser2: f32,
    pub fuser3: f32,
    pub fuser4: f32,
    pub vuser1: vec3_t,
    pub vuser2: vec3_t,
    pub vuser3: vec3_t,
    pub vuser4: vec3_t,
    pub numphysent: ::std::os::raw::c_int,
    pub physents: [physent_t; 600usize],
    pub nummoveent: ::std::os::raw::c_int,
    pub moveents: [physent_t; 64usize],
    pub numvisent: ::std::os::raw::c_int,
    pub visents: [physent_t; 600usize],
    pub cmd: usercmd_t,
    pub numtouch: ::std::os::raw::c_int,
    pub touchindex: [pmtrace_t; 600usize],
    pub physinfo: [::std::os::raw::c_char; 256usize],
    pub movevars: *mut movevars_s,
    pub player_mins: [vec3_t; 4usize],
    pub player_maxs: [vec3_t; 4usize],
    pub PM_Info_ValueForKey: ::std::option::Option<
        unsafe extern "C" fn(
            s: *const ::std::os::raw::c_char,
            key: *const ::std::os::raw::c_char,
        ) -> *const ::std::os::raw::c_char,
    >,
    pub PM_Particle: ::std::option::Option<
        unsafe extern "C" fn(
            origin: *mut f32,
            color: ::std::os::raw::c_int,
            life: f32,
            zpos: ::std::os::raw::c_int,
            zvel: ::std::os::raw::c_int,
        ),
    >,
    pub PM_TestPlayerPosition: ::std::option::Option<
        unsafe extern "C" fn(pos: *mut f32, ptrace: *mut pmtrace_t) -> ::std::os::raw::c_int,
    >,
    pub Con_NPrintf: ::std::option::Option<
        unsafe extern "C" fn(idx: ::std::os::raw::c_int, fmt: *mut ::std::os::raw::c_char, ...),
    >,
    pub Con_DPrintf:
        ::std::option::Option<unsafe extern "C" fn(fmt: *mut ::std::os::raw::c_char, ...)>,
    pub Con_Printf:
        ::std::option::Option<unsafe extern "C" fn(fmt: *mut ::std::os::raw::c_char, ...)>,
    pub Sys_FloatTime: ::std::option::Option<unsafe extern "C" fn() -> f64>,
    pub PM_StuckTouch: ::std::option::Option<
        unsafe extern "C" fn(hitent: ::std::os::raw::c_int, ptraceresult: *mut pmtrace_t),
    >,
    pub PM_PointContents: ::std::option::Option<
        unsafe extern "C" fn(
            p: *mut f32,
            truecontents: *mut ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub PM_TruePointContents:
        ::std::option::Option<unsafe extern "C" fn(p: *mut f32) -> ::std::os::raw::c_int>,
    pub PM_HullPointContents: ::std::option::Option<
        unsafe extern "C" fn(
            hull: *mut hull_s,
            num: ::std::os::raw::c_int,
            p: *mut f32,
        ) -> ::std::os::raw::c_int,
    >,
    pub PM_PlayerTrace: ::std::option::Option<
        unsafe extern "C" fn(
            start: *const f32,
            end: *const f32,
            traceFlags: TraceFlags,
            ignore_pe: ::std::os::raw::c_int,
        ) -> pmtrace_t,
    >,
    pub PM_TraceLine: ::std::option::Option<
        unsafe extern "C" fn(
            start: *mut f32,
            end: *mut f32,
            flags: ::std::os::raw::c_int,
            usehulll: ::std::os::raw::c_int,
            ignore_pe: ::std::os::raw::c_int,
        ) -> *mut pmtrace_s,
    >,
    pub RandomLong: ::std::option::Option<unsafe extern "C" fn(lLow: int32, lHigh: int32) -> int32>,
    pub RandomFloat: ::std::option::Option<unsafe extern "C" fn(flLow: f32, flHigh: f32) -> f32>,
    pub PM_GetModelType:
        ::std::option::Option<unsafe extern "C" fn(mod_: *mut model_s) -> ::std::os::raw::c_int>,
    pub PM_GetModelBounds: ::std::option::Option<
        unsafe extern "C" fn(mod_: *mut model_s, mins: *mut f32, maxs: *mut f32),
    >,
    pub PM_HullForBsp: ::std::option::Option<
        unsafe extern "C" fn(pe: *mut physent_t, offset: *mut f32) -> *mut ::std::os::raw::c_void,
    >,
    pub PM_TraceModel: ::std::option::Option<
        unsafe extern "C" fn(
            pEnt: *mut physent_t,
            start: *mut f32,
            end: *mut f32,
            trace: *mut trace_t,
        ) -> f32,
    >,
    pub COM_FileSize: ::std::option::Option<
        unsafe extern "C" fn(filename: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int,
    >,
    pub COM_LoadFile: ::std::option::Option<
        unsafe extern "C" fn(
            path: *mut ::std::os::raw::c_char,
            usehunk: ::std::os::raw::c_int,
            pLength: *mut ::std::os::raw::c_int,
        ) -> *mut byte,
    >,
    pub COM_FreeFile:
        ::std::option::Option<unsafe extern "C" fn(buffer: *mut ::std::os::raw::c_void)>,
    pub memfgets: ::std::option::Option<
        unsafe extern "C" fn(
            pMemFile: *mut byte,
            fileSize: ::std::os::raw::c_int,
            pFilePos: *mut ::std::os::raw::c_int,
            pBuffer: *mut ::std::os::raw::c_char,
            bufferSize: ::std::os::raw::c_int,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub runfuncs: qboolean,
    pub PM_PlaySound: ::std::option::Option<
        unsafe extern "C" fn(
            channel: ::std::os::raw::c_int,
            sample: *const ::std::os::raw::c_char,
            volume: f32,
            attenuation: f32,
            fFlags: ::std::os::raw::c_int,
            pitch: ::std::os::raw::c_int,
        ),
    >,
    pub PM_TraceTexture: ::std::option::Option<
        unsafe extern "C" fn(
            ground: ::std::os::raw::c_int,
            vstart: *mut f32,
            vend: *mut f32,
        ) -> *const ::std::os::raw::c_char,
    >,
    pub PM_PlaybackEventFull: ::std::option::Option<
        unsafe extern "C" fn(
            flags: ::std::os::raw::c_int,
            clientindex: ::std::os::raw::c_int,
            eventindex: ::std::os::raw::c_ushort,
            delay: f32,
            origin: *mut f32,
            angles: *mut f32,
            fparam1: f32,
            fparam2: f32,
            iparam1: ::std::os::raw::c_int,
            iparam2: ::std::os::raw::c_int,
            bparam1: ::std::os::raw::c_int,
            bparam2: ::std::os::raw::c_int,
        ),
    >,
    pub PM_PlayerTraceEx: ::std::option::Option<
        unsafe extern "C" fn(
            start: *mut f32,
            end: *mut f32,
            traceFlags: ::std::os::raw::c_int,
            pfnIgnore: ::std::option::Option<
                unsafe extern "C" fn(pe: *mut physent_t) -> ::std::os::raw::c_int,
            >,
        ) -> pmtrace_t,
    >,
    pub PM_TestPlayerPositionEx: ::std::option::Option<
        unsafe extern "C" fn(
            pos: *mut f32,
            ptrace: *mut pmtrace_t,
            pfnIgnore: ::std::option::Option<
                unsafe extern "C" fn(pe: *mut physent_t) -> ::std::os::raw::c_int,
            >,
        ) -> ::std::os::raw::c_int,
    >,
    pub PM_TraceLineEx: ::std::option::Option<
        unsafe extern "C" fn(
            start: *mut f32,
            end: *mut f32,
            flags: ::std::os::raw::c_int,
            usehulll: ::std::os::raw::c_int,
            pfnIgnore: ::std::option::Option<
                unsafe extern "C" fn(pe: *mut physent_t) -> ::std::os::raw::c_int,
            >,
        ) -> *mut pmtrace_s,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of playermove_s"][::std::mem::size_of::<playermove_s>() - 325068usize];
    ["Alignment of playermove_s"][::std::mem::align_of::<playermove_s>() - 4usize];
    ["Offset of field: playermove_s::player_index"]
        [::std::mem::offset_of!(playermove_s, player_index) - 0usize];
    ["Offset of field: playermove_s::server"]
        [::std::mem::offset_of!(playermove_s, server) - 4usize];
    ["Offset of field: playermove_s::multiplayer"]
        [::std::mem::offset_of!(playermove_s, multiplayer) - 8usize];
    ["Offset of field: playermove_s::time"][::std::mem::offset_of!(playermove_s, time) - 12usize];
    ["Offset of field: playermove_s::frametime"]
        [::std::mem::offset_of!(playermove_s, frametime) - 16usize];
    ["Offset of field: playermove_s::forward"]
        [::std::mem::offset_of!(playermove_s, forward) - 20usize];
    ["Offset of field: playermove_s::right"][::std::mem::offset_of!(playermove_s, right) - 32usize];
    ["Offset of field: playermove_s::up"][::std::mem::offset_of!(playermove_s, up) - 44usize];
    ["Offset of field: playermove_s::origin"]
        [::std::mem::offset_of!(playermove_s, origin) - 56usize];
    ["Offset of field: playermove_s::angles"]
        [::std::mem::offset_of!(playermove_s, angles) - 68usize];
    ["Offset of field: playermove_s::oldangles"]
        [::std::mem::offset_of!(playermove_s, oldangles) - 80usize];
    ["Offset of field: playermove_s::velocity"]
        [::std::mem::offset_of!(playermove_s, velocity) - 92usize];
    ["Offset of field: playermove_s::movedir"]
        [::std::mem::offset_of!(playermove_s, movedir) - 104usize];
    ["Offset of field: playermove_s::basevelocity"]
        [::std::mem::offset_of!(playermove_s, basevelocity) - 116usize];
    ["Offset of field: playermove_s::view_ofs"]
        [::std::mem::offset_of!(playermove_s, view_ofs) - 128usize];
    ["Offset of field: playermove_s::flDuckTime"]
        [::std::mem::offset_of!(playermove_s, flDuckTime) - 140usize];
    ["Offset of field: playermove_s::bInDuck"]
        [::std::mem::offset_of!(playermove_s, bInDuck) - 144usize];
    ["Offset of field: playermove_s::flTimeStepSound"]
        [::std::mem::offset_of!(playermove_s, flTimeStepSound) - 148usize];
    ["Offset of field: playermove_s::iStepLeft"]
        [::std::mem::offset_of!(playermove_s, iStepLeft) - 152usize];
    ["Offset of field: playermove_s::flFallVelocity"]
        [::std::mem::offset_of!(playermove_s, flFallVelocity) - 156usize];
    ["Offset of field: playermove_s::punchangle"]
        [::std::mem::offset_of!(playermove_s, punchangle) - 160usize];
    ["Offset of field: playermove_s::flSwimTime"]
        [::std::mem::offset_of!(playermove_s, flSwimTime) - 172usize];
    ["Offset of field: playermove_s::flNextPrimaryAttack"]
        [::std::mem::offset_of!(playermove_s, flNextPrimaryAttack) - 176usize];
    ["Offset of field: playermove_s::effects"]
        [::std::mem::offset_of!(playermove_s, effects) - 180usize];
    ["Offset of field: playermove_s::flags"]
        [::std::mem::offset_of!(playermove_s, flags) - 184usize];
    ["Offset of field: playermove_s::usehull"]
        [::std::mem::offset_of!(playermove_s, usehull) - 188usize];
    ["Offset of field: playermove_s::gravity"]
        [::std::mem::offset_of!(playermove_s, gravity) - 192usize];
    ["Offset of field: playermove_s::friction"]
        [::std::mem::offset_of!(playermove_s, friction) - 196usize];
    ["Offset of field: playermove_s::oldbuttons"]
        [::std::mem::offset_of!(playermove_s, oldbuttons) - 200usize];
    ["Offset of field: playermove_s::waterjumptime"]
        [::std::mem::offset_of!(playermove_s, waterjumptime) - 204usize];
    ["Offset of field: playermove_s::dead"][::std::mem::offset_of!(playermove_s, dead) - 208usize];
    ["Offset of field: playermove_s::deadflag"]
        [::std::mem::offset_of!(playermove_s, deadflag) - 212usize];
    ["Offset of field: playermove_s::spectator"]
        [::std::mem::offset_of!(playermove_s, spectator) - 216usize];
    ["Offset of field: playermove_s::movetype"]
        [::std::mem::offset_of!(playermove_s, movetype) - 220usize];
    ["Offset of field: playermove_s::onground"]
        [::std::mem::offset_of!(playermove_s, onground) - 224usize];
    ["Offset of field: playermove_s::waterlevel"]
        [::std::mem::offset_of!(playermove_s, waterlevel) - 228usize];
    ["Offset of field: playermove_s::watertype"]
        [::std::mem::offset_of!(playermove_s, watertype) - 232usize];
    ["Offset of field: playermove_s::oldwaterlevel"]
        [::std::mem::offset_of!(playermove_s, oldwaterlevel) - 236usize];
    ["Offset of field: playermove_s::sztexturename"]
        [::std::mem::offset_of!(playermove_s, sztexturename) - 240usize];
    ["Offset of field: playermove_s::chtexturetype"]
        [::std::mem::offset_of!(playermove_s, chtexturetype) - 496usize];
    ["Offset of field: playermove_s::maxspeed"]
        [::std::mem::offset_of!(playermove_s, maxspeed) - 500usize];
    ["Offset of field: playermove_s::clientmaxspeed"]
        [::std::mem::offset_of!(playermove_s, clientmaxspeed) - 504usize];
    ["Offset of field: playermove_s::iuser1"]
        [::std::mem::offset_of!(playermove_s, iuser1) - 508usize];
    ["Offset of field: playermove_s::iuser2"]
        [::std::mem::offset_of!(playermove_s, iuser2) - 512usize];
    ["Offset of field: playermove_s::iuser3"]
        [::std::mem::offset_of!(playermove_s, iuser3) - 516usize];
    ["Offset of field: playermove_s::iuser4"]
        [::std::mem::offset_of!(playermove_s, iuser4) - 520usize];
    ["Offset of field: playermove_s::fuser1"]
        [::std::mem::offset_of!(playermove_s, fuser1) - 524usize];
    ["Offset of field: playermove_s::fuser2"]
        [::std::mem::offset_of!(playermove_s, fuser2) - 528usize];
    ["Offset of field: playermove_s::fuser3"]
        [::std::mem::offset_of!(playermove_s, fuser3) - 532usize];
    ["Offset of field: playermove_s::fuser4"]
        [::std::mem::offset_of!(playermove_s, fuser4) - 536usize];
    ["Offset of field: playermove_s::vuser1"]
        [::std::mem::offset_of!(playermove_s, vuser1) - 540usize];
    ["Offset of field: playermove_s::vuser2"]
        [::std::mem::offset_of!(playermove_s, vuser2) - 552usize];
    ["Offset of field: playermove_s::vuser3"]
        [::std::mem::offset_of!(playermove_s, vuser3) - 564usize];
    ["Offset of field: playermove_s::vuser4"]
        [::std::mem::offset_of!(playermove_s, vuser4) - 576usize];
    ["Offset of field: playermove_s::numphysent"]
        [::std::mem::offset_of!(playermove_s, numphysent) - 588usize];
    ["Offset of field: playermove_s::physents"]
        [::std::mem::offset_of!(playermove_s, physents) - 592usize];
    ["Offset of field: playermove_s::nummoveent"]
        [::std::mem::offset_of!(playermove_s, nummoveent) - 134992usize];
    ["Offset of field: playermove_s::moveents"]
        [::std::mem::offset_of!(playermove_s, moveents) - 134996usize];
    ["Offset of field: playermove_s::numvisent"]
        [::std::mem::offset_of!(playermove_s, numvisent) - 149332usize];
    ["Offset of field: playermove_s::visents"]
        [::std::mem::offset_of!(playermove_s, visents) - 149336usize];
    ["Offset of field: playermove_s::cmd"][::std::mem::offset_of!(playermove_s, cmd) - 283736usize];
    ["Offset of field: playermove_s::numtouch"]
        [::std::mem::offset_of!(playermove_s, numtouch) - 283788usize];
    ["Offset of field: playermove_s::touchindex"]
        [::std::mem::offset_of!(playermove_s, touchindex) - 283792usize];
    ["Offset of field: playermove_s::physinfo"]
        [::std::mem::offset_of!(playermove_s, physinfo) - 324592usize];
    ["Offset of field: playermove_s::movevars"]
        [::std::mem::offset_of!(playermove_s, movevars) - 324848usize];
    ["Offset of field: playermove_s::player_mins"]
        [::std::mem::offset_of!(playermove_s, player_mins) - 324852usize];
    ["Offset of field: playermove_s::player_maxs"]
        [::std::mem::offset_of!(playermove_s, player_maxs) - 324900usize];
    ["Offset of field: playermove_s::PM_Info_ValueForKey"]
        [::std::mem::offset_of!(playermove_s, PM_Info_ValueForKey) - 324948usize];
    ["Offset of field: playermove_s::PM_Particle"]
        [::std::mem::offset_of!(playermove_s, PM_Particle) - 324952usize];
    ["Offset of field: playermove_s::PM_TestPlayerPosition"]
        [::std::mem::offset_of!(playermove_s, PM_TestPlayerPosition) - 324956usize];
    ["Offset of field: playermove_s::Con_NPrintf"]
        [::std::mem::offset_of!(playermove_s, Con_NPrintf) - 324960usize];
    ["Offset of field: playermove_s::Con_DPrintf"]
        [::std::mem::offset_of!(playermove_s, Con_DPrintf) - 324964usize];
    ["Offset of field: playermove_s::Con_Printf"]
        [::std::mem::offset_of!(playermove_s, Con_Printf) - 324968usize];
    ["Offset of field: playermove_s::Sys_FloatTime"]
        [::std::mem::offset_of!(playermove_s, Sys_FloatTime) - 324972usize];
    ["Offset of field: playermove_s::PM_StuckTouch"]
        [::std::mem::offset_of!(playermove_s, PM_StuckTouch) - 324976usize];
    ["Offset of field: playermove_s::PM_PointContents"]
        [::std::mem::offset_of!(playermove_s, PM_PointContents) - 324980usize];
    ["Offset of field: playermove_s::PM_TruePointContents"]
        [::std::mem::offset_of!(playermove_s, PM_TruePointContents) - 324984usize];
    ["Offset of field: playermove_s::PM_HullPointContents"]
        [::std::mem::offset_of!(playermove_s, PM_HullPointContents) - 324988usize];
    ["Offset of field: playermove_s::PM_PlayerTrace"]
        [::std::mem::offset_of!(playermove_s, PM_PlayerTrace) - 324992usize];
    ["Offset of field: playermove_s::PM_TraceLine"]
        [::std::mem::offset_of!(playermove_s, PM_TraceLine) - 324996usize];
    ["Offset of field: playermove_s::RandomLong"]
        [::std::mem::offset_of!(playermove_s, RandomLong) - 325000usize];
    ["Offset of field: playermove_s::RandomFloat"]
        [::std::mem::offset_of!(playermove_s, RandomFloat) - 325004usize];
    ["Offset of field: playermove_s::PM_GetModelType"]
        [::std::mem::offset_of!(playermove_s, PM_GetModelType) - 325008usize];
    ["Offset of field: playermove_s::PM_GetModelBounds"]
        [::std::mem::offset_of!(playermove_s, PM_GetModelBounds) - 325012usize];
    ["Offset of field: playermove_s::PM_HullForBsp"]
        [::std::mem::offset_of!(playermove_s, PM_HullForBsp) - 325016usize];
    ["Offset of field: playermove_s::PM_TraceModel"]
        [::std::mem::offset_of!(playermove_s, PM_TraceModel) - 325020usize];
    ["Offset of field: playermove_s::COM_FileSize"]
        [::std::mem::offset_of!(playermove_s, COM_FileSize) - 325024usize];
    ["Offset of field: playermove_s::COM_LoadFile"]
        [::std::mem::offset_of!(playermove_s, COM_LoadFile) - 325028usize];
    ["Offset of field: playermove_s::COM_FreeFile"]
        [::std::mem::offset_of!(playermove_s, COM_FreeFile) - 325032usize];
    ["Offset of field: playermove_s::memfgets"]
        [::std::mem::offset_of!(playermove_s, memfgets) - 325036usize];
    ["Offset of field: playermove_s::runfuncs"]
        [::std::mem::offset_of!(playermove_s, runfuncs) - 325040usize];
    ["Offset of field: playermove_s::PM_PlaySound"]
        [::std::mem::offset_of!(playermove_s, PM_PlaySound) - 325044usize];
    ["Offset of field: playermove_s::PM_TraceTexture"]
        [::std::mem::offset_of!(playermove_s, PM_TraceTexture) - 325048usize];
    ["Offset of field: playermove_s::PM_PlaybackEventFull"]
        [::std::mem::offset_of!(playermove_s, PM_PlaybackEventFull) - 325052usize];
    ["Offset of field: playermove_s::PM_PlayerTraceEx"]
        [::std::mem::offset_of!(playermove_s, PM_PlayerTraceEx) - 325056usize];
    ["Offset of field: playermove_s::PM_TestPlayerPositionEx"]
        [::std::mem::offset_of!(playermove_s, PM_TestPlayerPositionEx) - 325060usize];
    ["Offset of field: playermove_s::PM_TraceLineEx"]
        [::std::mem::offset_of!(playermove_s, PM_TraceLineEx) - 325064usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct model_s {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct movevars_s {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hull_s {
    _unused: [u8; 0],
}
